results/linux/concurrent_high.txt
Running 1m test @ http://localhost:3000/concurrent
  8 threads and 500 connections
  Thread calibration: mean lat.: 1933.530ms, rate sampling interval: 7061ms
  Thread calibration: mean lat.: 1904.463ms, rate sampling interval: 7061ms
  Thread calibration: mean lat.: 2016.216ms, rate sampling interval: 7294ms
  Thread calibration: mean lat.: 1981.286ms, rate sampling interval: 7094ms
  Thread calibration: mean lat.: 2035.836ms, rate sampling interval: 7352ms
  Thread calibration: mean lat.: 1996.726ms, rate sampling interval: 7274ms
  Thread calibration: mean lat.: 1946.232ms, rate sampling interval: 7094ms
  Thread calibration: mean lat.: 1974.514ms, rate sampling interval: 7356ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.62s     5.99s   27.39s    58.12%
    Req/Sec   736.52     48.30   788.00     71.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.12s 
 75.000%   19.66s 
 90.000%   22.43s 
 99.000%   24.90s 
 99.900%   26.07s 
 99.990%   26.79s 
 99.999%   27.16s 
100.000%   27.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2590.719     0.000000            1         1.00
    5853.183     0.100000        29424         1.11
    8032.255     0.200000        58797         1.25
   10944.511     0.300000        88259         1.43
   13279.231     0.400000       117600         1.67
   15122.431     0.500000       146954         2.00
   16023.551     0.550000       161680         2.22
   16908.287     0.600000       176414         2.50
   17842.175     0.650000       191242         2.86
   18759.679     0.700000       205809         3.33
   19660.799     0.750000       220439         4.00
   20119.551     0.775000       227758         4.44
   20578.303     0.800000       235307         5.00
   21037.055     0.825000       242537         5.71
   21495.807     0.850000       249803         6.67
   21954.559     0.875000       257158         8.00
   22183.935     0.887500       260904         8.89
   22429.695     0.900000       264770        10.00
   22659.071     0.912500       268246        11.43
   22904.831     0.925000       271924        13.33
   23166.975     0.937500       275649        16.00
   23298.047     0.943750       277345        17.78
   23445.503     0.950000       279187        20.00
   23609.343     0.956250       281075        22.86
   23789.567     0.962500       282970        26.67
   24002.559     0.968750       284843        32.00
   24100.863     0.971875       285703        35.56
   24215.551     0.975000       286659        40.00
   24330.239     0.978125       287526        45.71
   24461.311     0.981250       288432        53.33
   24608.767     0.984375       289373        64.00
   24674.303     0.985938       289779        71.11
   24756.223     0.987500       290270        80.00
   24854.527     0.989062       290705        91.43
   24952.831     0.990625       291191       106.67
   25067.519     0.992188       291638       128.00
   25116.671     0.992969       291852       142.22
   25182.207     0.993750       292043       160.00
   25280.511     0.994531       292312       182.86
   25346.047     0.995313       292505       213.33
   25477.119     0.996094       292746       256.00
   25526.271     0.996484       292844       284.44
   25591.807     0.996875       292980       320.00
   25657.343     0.997266       293100       365.71
   25722.879     0.997656       293187       426.67
   25821.183     0.998047       293317       512.00
   25870.335     0.998242       293363       568.89
   25919.487     0.998437       293426       640.00
   25968.639     0.998633       293492       731.43
   26017.791     0.998828       293536       853.33
   26083.327     0.999023       293589      1024.00
   26132.479     0.999121       293623      1137.78
   26181.631     0.999219       293648      1280.00
   26263.551     0.999316       293677      1462.86
   26345.471     0.999414       293711      1706.67
   26394.623     0.999512       293736      2048.00
   26427.391     0.999561       293747      2275.56
   26476.543     0.999609       293767      2560.00
   26492.927     0.999658       293775      2925.71
   26558.463     0.999707       293790      3413.33
   26607.615     0.999756       293807      4096.00
   26623.999     0.999780       293812      4551.11
   26656.767     0.999805       293823      5120.00
   26673.151     0.999829       293828      5851.43
   26689.535     0.999854       293834      6826.67
   26722.303     0.999878       293841      8192.00
   26738.687     0.999890       293843      9102.22
   26787.839     0.999902       293848     10240.00
   26804.223     0.999915       293853     11702.86
   26820.607     0.999927       293855     13653.33
   26886.143     0.999939       293858     16384.00
   26902.527     0.999945       293861     18204.44
   26902.527     0.999951       293861     20480.00
   26918.911     0.999957       293864     23405.71
   26935.295     0.999963       293866     27306.67
   26951.679     0.999969       293867     32768.00
   26951.679     0.999973       293867     36408.89
   26984.447     0.999976       293868     40960.00
   27049.983     0.999979       293869     46811.43
   27066.367     0.999982       293870     54613.33
   27099.135     0.999985       293871     65536.00
   27099.135     0.999986       293871     72817.78
   27164.671     0.999988       293872     81920.00
   27164.671     0.999989       293872     93622.86
   27213.823     0.999991       293873    109226.67
   27213.823     0.999992       293873    131072.00
   27213.823     0.999993       293873    145635.56
   27246.591     0.999994       293874    163840.00
   27246.591     0.999995       293874    187245.71
   27246.591     0.999995       293874    218453.33
   27246.591     0.999996       293874    262144.00
   27246.591     0.999997       293874    291271.11
   27410.431     0.999997       293875    327680.00
   27410.431     1.000000       293875          inf
#[Mean    =    14616.449, StdDeviation   =     5989.236]
#[Max     =    27394.048, Total count    =       293875]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  355908 requests in 1.00m, 48.54MB read
Requests/sec:   5931.53
Transfer/sec:    828.33KB