results/linux/concurrent_low.txt
Running 1m test @ http://localhost:3000/concurrent
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.026ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  539.86us  20.61ms   78.80%
    Req/Sec   525.43    104.78     1.55k    62.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.34ms
 90.000%    1.57ms
 99.000%    2.25ms
 99.900%    5.97ms
 99.990%   13.58ms
 99.999%   20.40ms
100.000%   20.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.141     0.000000            1         1.00
       0.471     0.100000         9994         1.11
       0.632     0.200000        20024         1.25
       0.767     0.300000        29968         1.43
       0.899     0.400000        39997         1.67
       1.029     0.500000        49966         2.00
       1.092     0.550000        54941         2.22
       1.155     0.600000        59926         2.50
       1.216     0.650000        64949         2.86
       1.277     0.700000        69922         3.33
       1.339     0.750000        74935         4.00
       1.372     0.775000        77408         4.44
       1.407     0.800000        79922         5.00
       1.442     0.825000        82421         5.71
       1.481     0.850000        84948         6.67
       1.523     0.875000        87443         8.00
       1.547     0.887500        88692         8.89
       1.572     0.900000        89912        10.00
       1.601     0.912500        91162        11.43
       1.633     0.925000        92386        13.33
       1.675     0.937500        93666        16.00
       1.699     0.943750        94274        17.78
       1.728     0.950000        94900        20.00
       1.759     0.956250        95507        22.86
       1.802     0.962500        96136        26.67
       1.849     0.968750        96765        32.00
       1.875     0.971875        97072        35.56
       1.910     0.975000        97388        40.00
       1.946     0.978125        97696        45.71
       1.990     0.981250        98008        53.33
       2.053     0.984375        98325        64.00
       2.091     0.985938        98478        71.11
       2.139     0.987500        98629        80.00
       2.203     0.989062        98787        91.43
       2.279     0.990625        98940       106.67
       2.399     0.992188        99097       128.00
       2.483     0.992969        99175       142.22
       2.583     0.993750        99252       160.00
       2.707     0.994531        99330       182.86
       2.901     0.995313        99409       213.33
       3.121     0.996094        99487       256.00
       3.303     0.996484        99525       284.44
       3.505     0.996875        99564       320.00
       3.641     0.997266        99603       365.71
       3.917     0.997656        99643       426.67
       4.207     0.998047        99681       512.00
       4.407     0.998242        99701       568.89
       4.791     0.998437        99721       640.00
       5.095     0.998633        99740       731.43
       5.531     0.998828        99759       853.33
       6.035     0.999023        99779      1024.00
       6.447     0.999121        99789      1137.78
       7.159     0.999219        99798      1280.00
       7.467     0.999316        99808      1462.86
       8.055     0.999414        99818      1706.67
       8.647     0.999512        99828      2048.00
       8.903     0.999561        99833      2275.56
       9.327     0.999609        99837      2560.00
       9.823     0.999658        99842      2925.71
      10.111     0.999707        99847      3413.33
      10.703     0.999756        99852      4096.00
      11.391     0.999780        99855      4551.11
      11.591     0.999805        99857      5120.00
      12.167     0.999829        99859      5851.43
      12.615     0.999854        99862      6826.67
      12.735     0.999878        99864      8192.00
      13.583     0.999890        99866      9102.22
      14.127     0.999902        99867     10240.00
      15.015     0.999915        99868     11702.86
      15.183     0.999927        99869     13653.33
      15.223     0.999939        99870     16384.00
      15.543     0.999945        99871     18204.44
      15.999     0.999951        99872     20480.00
      15.999     0.999957        99872     23405.71
      16.303     0.999963        99873     27306.67
      16.303     0.999969        99873     32768.00
      19.039     0.999973        99874     36408.89
      19.039     0.999976        99874     40960.00
      19.039     0.999979        99874     46811.43
      20.399     0.999982        99875     54613.33
      20.399     0.999985        99875     65536.00
      20.399     0.999986        99875     72817.78
      20.399     0.999988        99875     81920.00
      20.399     0.999989        99875     93622.86
      20.623     0.999991        99876    109226.67
      20.623     1.000000        99876          inf
#[Mean    =        1.048, StdDeviation   =        0.540]
#[Max     =       20.608, Total count    =        99876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119968 requests in 1.00m, 16.36MB read
Requests/sec:   1999.41
Transfer/sec:    279.21KB